Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/tdd_ita-level2.tmx
Source language: en_us
Languages: it_it

source: The Test List is now created automatically by the framework from all methods marked with a [Fact] attribute.
it_it: La Test List viene ora creato automaticamente dal framework da tutti i metodi contrassegnati con un attributo [Fact].

source: The Test Method is present and looks almost the same as before.
it_it: Il Test Method è presente e sembra quasi lo stesso di prima.

source: The class itself does not do any important stuff, but let's try to imagine hard that this is some serious domain logic.
it_it: La classe in sé non fa nulla di importante, ma proviamo a immaginare che si tratti di una logica di un dominio serio.

source: The code for such a fake connection could look like this:
it_it: Il codice per una connessione falsa potrebbe assomigliare a questo:

source: The code is pretty straightforward:
it_it: Il codice è piuttosto semplice:

source: The database might not allow us to add the same item again and the test would fail.
it_it: Il database potrebbe non consentirci di aggiungere nuovamente lo stesso elemento e il test fallirebbe.

source: The essential tools {#chapter-essential-tools}
it_it: Gli strumenti essenziali {#chapter-essential-tools}

source: The first tool we'll use is a test framework.
it_it: Il primo strumento che utilizzeremo è un framework di test.

source: The goal is to focus on the core of TDD before going into its specific applications and to slowly introduce some concepts in an easy to grasp manner.
it_it: L'obiettivo è quello di concentrarsi sul nocciolo del TDD prima di passare alle sue applicazioni specifiche e introdurre man mano alcuni concetti in modo facile da comprendere.

source: The more you use this class, the more it grows with other methods for creating customized objects.
it_it: Più usi questa classe, più cresce con altri metodi per creare oggetti personalizzati.

source: The most obvious way would be to invoke it from the command line manually with some exemplary arguments, then check the output to the console and compare it with what we expected to see.
it_it: Il modo più ovvio sarebbe quello di invocarlo manualmente dalla riga di comando con alcuni argomenti esemplificativi, poi controllare l'output sulla console e confrontarlo con quello che ci aspettavamo di vedere.

source: The second was to play with a single string, learn how to make it sound in different ways and try to play some melodies by ear just with this one string.
it_it: Il secondo era suonare con una sola corda, imparare a farla suonare in modi diversi e provare a suonare alcune melodie a orecchio solo con questa corda.

source: The simplest implementation of such class would look like this:
it_it: L'implementazione più semplice di tale classe sarebbe simile alla seguente:

source: The test will also be much quicker now because we are not accessing the database anymore.
it_it: Inoltre il test sarà molto più veloce ora perché non potremo più accedere al database.

source: The test will most probably be slow because accessing the database is relatively slow.
it_it: Molto probabilmente il test sarà lento perché l'accesso al database è relativamente lento.

source: The thing they have in common is that when the "kid" starts learning karate (or kung-fu) from his master, he is given a basic, repetitive task (like taking off a jacket and putting it on again), not knowing yet where it would lead him.
it_it: La cosa che hanno in comune è che quando il ragazzo "[kid]" inizia a imparare il karate (o il kung-fu) dal suo maestro, gli viene assegnato un compito basilare e ripetitivo (come togliersi una giacca e indossarla di nuovo), senza sapere ancora dove lo avrebbe portato.

source: There are several reasons for that:
it_it: Ci sono diverse ragioni per questo:

source: There may be no implementation of the database engine for the operating system running on our development machine if our target is an exotic or mobile platform.
it_it: Potrebbe non esserci alcuna implementazione del motore di database per il sistema operativo in esecuzione sulla nostra macchina di sviluppo se il nostro obiettivo è una piattaforma esotica o mobile.

source: There's no need to maintain one or more central lists anymore, so the Main() method is no more.
it_it: Non è più necessario mantenere uno o più elenchi centrali, quindi il metodo Main() non esiste più.

source: These in-the-air techniques were called "juggles".
it_it: Queste tecniche volanti erano chiamate "juggles".

source: These values are important from the database point of view, but we already took the real database out of the picture.
it_it: Questi valori sono importanti dal punto di vista del database, ma abbiamo già escluso il database vero e proprio.

source: They can also record the methods that are invoked on them and allow the test to verify whether the communication between our object under test and its dependencies is correct.
it_it: Possono anche registrare i metodi che vengono invocati su di essi e consentire al test di verificare se la comunicazione tra il nostro oggetto in test e le sue dipendenze è corretta.

source: They derive their structure and functionality from Smalltalk's SUnit and are collectively referred to as xUnit family of test frameworks.
it_it: Derivano la loro struttura e funzionalità da SUnit di Smalltalk e sono collettivamente indicati come famiglia xUnit di framework di test.

source: This allows us to remove the AnonymousOrder() method, thus making our test setup shorter.
it_it: Questo ci consente di rimuovere il metodo AnonymousOrder(), rendendo così più breve la configurazione del nostro test.

source: This chapter introduced the three tools we'll use in this book that, when mastered, will make your test-driven development flow smoother.
it_it: Questo capitolo ha introdotto i tre strumenti che utilizzeremo in questo libro che, una volta padroneggiati, renderanno più fluido il flusso di sviluppo basato sui test.

source: This explanation of mock objects is very shallow and its purpose is only to get you up and running.
it_it: Questa spiegazione degli oggetti mock è molto superficiale e il suo scopo è solo quello di farti iniziare a lavorare.

source: This happens in a different way, depending on a language.
it_it: Ciò avviene in modo diverso, a seconda della linguaggio.

source: This is a very powerful feature, because we can simulate or verify conditions that would be difficult to achieve or observe using only production code.
it_it: Questa è una funzionalità molto potente, perché possiamo simulare o verificare condizioni che sarebbero difficili da ottenere o osservare utilizzando solo il codice di produzione.

source: This is correct, so we assume the application has passed the test.
it_it: Questo è corretto, quindi presumiamo che l'applicazione abbia superato il test.

source: This method can be given a name that describes what the test is about:
it_it: A questo metodo si può assegnare un nome che descriva lo scopo del test:

source: This might suggest that the exact values are important from the perspective of the behavior we are testing.
it_it: Ciò potrebbe suggerire che i valori esatti siano importanti dal punto di vista del comportamento che stiamo testando.

source: This raises the question: why don't more people learn and use TDD as their software delivery method of choice?
it_it: Ciò fa sorgere la domanda: perché più persone non imparano e utilizzano TDD come metodo di distribuzione del software preferito?

source: This, however, does not allow us to test a single object or a small cluster of objects in isolation, where we would be able to verify that just a small part of the application works correctly.
it_it: Questo però non ci permette di testare un singolo oggetto o un piccolo gruppo di oggetti isolatamente, dove potremmo verificare che solo una piccola parte dell'applicazione funzioni correttamente.

source: Thus, if we try, we can make the tested code use our fake without knowing.
it_it: Pertanto, se ci proviamo, possiamo fare in modo che il codice testato utilizzi il nostro fake senza saperlo.

source: To be honest, I can't wait to show you how the test we just wrote looks like when a test framework is used.
it_it: Ad essere onesti, non vedo l'ora di mostrarti come appare il test che abbiamo appena scritto quando viene utilizzato un framework di test.

source: To illustrate this, here is (finally!) the same test we wrote above, now using the xUnit.Net test framework:
it_it: Per illustrare ciò, ecco (finalmente!) lo stesso test che abbiamo scritto sopra, utilizzando ora il framework di test xUnit.Net:

source: To our joy, those three elements are present as well when we use a test framework.
it_it: Con nostra gioia, questi tre elementi sono presenti anche quando utilizziamo un framework di test.

source: To remove this clutter let's introduce a method with a descriptive name to create the order and hide the details we don't need from the reader of the test:
it_it: Per rimuovere questa confusione, introduciamo un metodo con un nome descrittivo per creare l'ordine e nascondere i dettagli che non ci servono al lettore del test:

source: Unfortunately, my observation is that Test-Driven Development tends to fall into this category for many people.
it_it: Sfortunatamente, la mia osservazione è che il Test-Driven Development tende a rientrare in questa categoria per molte persone.

source: Using NSubstitute, our first test can be rewritten as:
it_it: Utilizzando NSubstitute, il nostro primo test può essere riscritto come:

source: W> This introduction is written for those who are not proficient with using mocks.
it_it: W> Questa introduzione è scritta per coloro che non sono esperti nell'uso dei mock.

source: We can delete the method and get rid of some more maintenance trouble.
it_it: Possiamo eliminare il metodo ed eliminare altri problemi di manutenzione.

source: We can spare some coding by making our mocks a bit more generic so that their behavior can be configured using lambda expressions:
it_it: Possiamo risparmiare parte della codifica rendendo i nostri mock un po' più generici in modo che il loro comportamento possa essere configurato utilizzando le espressioni lambda:

source: We may have a vague understanding of the reasons, such as "the code will be more tested" for example.
it_it: Potremmo avere una vaga comprensione delle ragioni, come ad esempio "il codice sarà più testato".

source: We still have to write another one for the scenario where inserting an order ends with an exception.
it_it: Dobbiamo ancora scriverne un altro per lo scenario in cui l'inserimento di un ordine termina con un'eccezione.

source: We won't be dealing with mock objects until part 2, where I offer a richer and more accurate description of the concept.
it_it: Non ci occuperemo degli oggetti mock fino alla parte 2, dove offro una descrizione più ricca e accurata del concetto.

source: We'll get back to mocks later as we've only scratched the surface here.
it_it: Torneremo ai mock più tardi poiché qui abbiamo solo scalfito la superficie.

source: Well, to tell you the truth, they are not literally gone -- it's just that the test framework offers far better replacements, so we used them instead.
it_it: Beh, a dire il vero, non sono letteralmente spariti: è solo che il framework di test offre sostituti di gran lunga migliori, quindi li abbiamo utilizzati al loro posto.

source: What TDD feels like
it_it: A cosa assomiglia il TDD

source: What if the schema gets outdated -- will everyone manage to notice it and update the schema of their local databases accordingly?
it_it: Cosa succede se lo schema diventa obsoleto: tutti riusciranno a notarlo e ad aggiornare di conseguenza lo schema dei propri database locali?

source: What if their setup is slightly different from ours?
it_it: E se la loro configurazione fosse leggermente diversa dalla nostra?

source: What if we wanted to check some conditions on collections, e.g. that a collection is sorted or that all items in the collection are unique?
it_it: E se volessimo verificare alcune condizioni sulle collezioni, ad es. che una collezione sia ordinata o che tutti gli elementi della collezione siano unici?

source: What if we wanted to check the equality not for integers, but characters, strings, floats, etc.?
it_it: E se volessimo verificare l'uguaglianza non per gli interi, ma per i caratteri, le stringhe, i numeri in virgola mobile, ecc.?

source: What's more, we can now easily write a test for the error case.
it_it: Inoltre, ora possiamo scrivere facilmente un test per il caso di errore.

source: When I first tried to learn how to play guitar, I found two pieces of advice on the web: the first was to start by mastering a single, difficult song.
it_it: Quando ho provato a imparare a suonare la chitarra ho trovato due consigli sul web: il primo era quello di iniziare padroneggiando un singolo brano difficile.

source: When we want to test a class that depends on other classes, we may think it's a good idea to include those classes in the test as well.
it_it: Quando vogliamo testare una classe che dipende da altre classi, potremmo pensare che sia una buona idea includere anche quelle classi nel test.

source: Why do we clean up the database at the beginning of the test?
it_it: Perché puliamo il database all'inizio del test?

source: Why is it then that we spent more than a year on it?
it_it: Perché allora ci abbiamo dedicato più di un anno?

source: Without going much into advanced aspects, such as applying TDD to object-oriented systems where multiple objects collaborate (which is a topic of part 2), I introduce the basic TDD philosophy and practices.
it_it: Senza entrare molto in dettaglio, come applicare il TDD ai sistemi object-oriented in cui più oggetti collaborano (che è un argomento della parte 2), viene presentata la filosofia e le pratiche basilari del TDD.

source: Wouldn't it be easier if you could click on the error message to take you immediately to the code where the failure occurred?
it_it: Non sarebbe più semplice se potessi cliccare sul messaggio di errore per portarti immediatamente al codice in cui si è verificato l'errore?

source: Wouldn't that be time-consuming?
it_it: Non sarebbe una perdita di tempo?

source: Yes, Tekken was easy to learn -- I could put one hour into training the core moves of a character and then be able to "use" this character, but I knew that what would make me a great fighter was the experience and knowledge on which techniques were risky and which were not, which ones could be used in which situations, which ones, if used one after another, gave the opponent little chance to counterattack, etc.
it_it: Sì, Tekken era facile da imparare: potevo dedicare un'ora ad allenare le mosse principali di un personaggio e poi essere in grado di "usare" questo personaggio, ma sapevo che ciò che mi avrebbe reso un grande combattente era l'esperienza e la conoscenza su quali tecniche erano rischiose e quali no, quali potevano essere usate in quali situazioni, quali, se usate una dopo l'altra, davano all'avversario poche possibilità di contrattaccare, ecc.

source: You don't need to understand their full purpose yet, just go out and play :-).
it_it: Non è necessario che tu capisca ancora il loro scopo completo, basta uscire e giocare :-).

source: You probably heard the mantra "red-green-refactor" or the general advice "write your test first, then the code", maybe you even did some experiments on your own where you were trying to implement a bubble-sort algorithm or other simple stuff by starting with a test.
it_it: Probabilmente hai sentito il mantra "red-green-refactor" o il consiglio generale "scrivi prima il test, poi il codice", forse hai anche fatto alcuni esperimenti per conto tuo cercando di implementare un algoritmo di bubble sort o altri semplici cose iniziando con un test.

source: orderDatabase.Clean(); //clean up after potential previous tests
it_it: orderDatabase.Clean(); //ripulisce dopo eventuali test precedenti

source: the name, surname, product, date, and quantity are very specific.
it_it: name, surname, product, date e quantity sono molto specifici.

source: var orderDatabase = new MySqlOrderDatabase(); //uses real database
it_it: var orderDatabase = new MySqlOrderDatabase(); //usa il database reale

source: we can spot that these values are not used anywhere -- the tested class does not use or check them in any way.
it_it: possiamo notare che questi valori non vengono utilizzati da nessuna parte: la classe testata non li utilizza né li controlla in alcun modo.
